Revit 2027 API
UnitUtils.GetTypeCatalogStringForSpec Method
 Gets the string used in type catalogs to identify a given measurable spec.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GetTypeCatalogStringForSpec(
	ForgeTypeId specTypeId
)
Public Shared Function GetTypeCatalogStringForSpec (
	specTypeId As ForgeTypeId
) As String
public:
static String^ GetTypeCatalogStringForSpec(
	ForgeTypeId^ specTypeId
)
static member GetTypeCatalogStringForSpec :
        specTypeId : ForgeTypeId -> string
Parameters
specTypeId ForgeTypeId
 Identifier of the measurable spec.
Return Value
String
 The type catalog string, or an empty string if the measurable spec cannot be used in type catalogs.
Exceptions
Exception | Condition
ArgumentException |  specTypeId is not a measurable spec identifier. See UnitUtils.IsMeasurableSpec(ForgeTypeId).
ArgumentNullException |  A non-optional argument was null
See Also
Reference
UnitUtils Class
Autodesk.Revit.DB Namespace